
from src.core.models import SubstoryRoute, StoryRouter
from src.content.ядерный_похмельник import ЯДЕРНЫЙ_ПОХМЕЛЬНИК


# Общая история вообще всех игр
STORY = StoryRouter.from_stories(
    code='o',
    content=(
        'Добро пожаловать в игру! 🍫\n'
        'Иногда на Новый год я делаю подарочные квесты для Ошибки Снека.\n'
        'Предлагаю тебе в них поиграть.\n'
        '🐞 Если что-то не работает — сюда в директ: @kolya\\_ignatev'
    ),
    routes=(
        SubstoryRoute('Ядерный похмельник ☢️ (2023)', story=ЯДЕРНЫЙ_ПОХМЕЛЬНИК),
    )
)
